<!-- terraform-plan-repository -->
### Terraform Plan: `repository` ❌ Error

<details>
<summary>Show plan output</summary>

```
data.github_user.reviewer: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # github_issue_label.infrastructure will be created
  + resource "github_issue_label" "infrastructure" {
      + color       = "0e8a16"
      + description = "Infrastructure and Terraform changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "infrastructure"
      + repository  = "reinhardt"
      + url         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Error: GET https://api.github.com/user: 401 Requires authentication []

  with data.github_user.reviewer,
  on environments.tf line 4, in data "github_user" "reviewer":
   4: data "github_user" "reviewer" {

::error::Terraform exited with code 1.

```

</details>